Dati/JMeter Report/Report Stress Test 1000 U - 10 RUP - 1200s D/statistics.json
{
  "Dashboard Request" : {
    "transaction" : "Dashboard Request",
    "sampleCount" : 21572,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 378.0982755423716,
    "medianResTime" : 161.0,
    "minResTime" : 3.0,
    "maxResTime" : 7445.0,
    "pct1ResTime" : 620.0,
    "pct2ResTime" : 830.9500000000007,
    "pct3ResTime" : 1305.9900000000016,
    "throughput" : 18.009233363665963,
    "receivedKBytesPerSec" : 10.511733327141581,
    "sentKBytesPerSec" : 6.535620664034129
  },
  "Pay Bill Request" : {
    "transaction" : "Pay Bill Request",
    "sampleCount" : 21385,
    "errorCount" : 2996,
    "errorPct" : 14.00982,
    "meanResTime" : 205.64372223521113,
    "medianResTime" : 129.0,
    "minResTime" : 5.0,
    "maxResTime" : 2759.0,
    "pct1ResTime" : 496.0,
    "pct2ResTime" : 646.0,
    "pct3ResTime" : 1022.0,
    "throughput" : 18.03638314220193,
    "receivedKBytesPerSec" : 10.94325415101433,
    "sentKBytesPerSec" : 9.637788655401764
  },
  "Deposit for Savings Goal Request" : {
    "transaction" : "Deposit for Savings Goal Request",
    "sampleCount" : 20849,
    "errorCount" : 3184,
    "errorPct" : 15.271716,
    "meanResTime" : 176.23943594416977,
    "medianResTime" : 95.0,
    "minResTime" : 4.0,
    "maxResTime" : 2356.0,
    "pct1ResTime" : 460.0,
    "pct2ResTime" : 629.0,
    "pct3ResTime" : 1099.9900000000016,
    "throughput" : 18.05833685567189,
    "receivedKBytesPerSec" : 6.383540525154694,
    "sentKBytesPerSec" : 8.738298904549099
  },
  "Delete Savings Goal Request" : {
    "transaction" : "Delete Savings Goal Request",
    "sampleCount" : 20749,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 252.69531061738027,
    "medianResTime" : 140.0,
    "minResTime" : 13.0,
    "maxResTime" : 3107.0,
    "pct1ResTime" : 601.0,
    "pct2ResTime" : 855.9500000000007,
    "pct3ResTime" : 1480.0,
    "throughput" : 18.044585754613113,
    "receivedKBytesPerSec" : 6.6962329948759605,
    "sentKBytesPerSec" : 7.07706276405067
  },
  "Withdraw from Savings Goal Request" : {
    "transaction" : "Withdraw from Savings Goal Request",
    "sampleCount" : 20799,
    "errorCount" : 3171,
    "errorPct" : 15.245925,
    "meanResTime" : 213.55925765661806,
    "medianResTime" : 116.0,
    "minResTime" : 5.0,
    "maxResTime" : 2997.0,
    "pct1ResTime" : 538.0,
    "pct2ResTime" : 746.9500000000007,
    "pct3ResTime" : 1315.9900000000016,
    "throughput" : 18.06099003298026,
    "receivedKBytesPerSec" : 6.371570031111117,
    "sentKBytesPerSec" : 8.739739054448687
  },
  "Get Phone TopUp Contact Request" : {
    "transaction" : "Get Phone TopUp Contact Request",
    "sampleCount" : 20960,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.41083015267162,
    "medianResTime" : 36.0,
    "minResTime" : 3.0,
    "maxResTime" : 1766.0,
    "pct1ResTime" : 271.0,
    "pct2ResTime" : 419.0,
    "pct3ResTime" : 735.9900000000016,
    "throughput" : 18.062238890344286,
    "receivedKBytesPerSec" : 44.913383752236236,
    "sentKBytesPerSec" : 6.731242687260003
  },
  "Transfer Request" : {
    "transaction" : "Transfer Request",
    "sampleCount" : 21506,
    "errorCount" : 3081,
    "errorPct" : 14.326235,
    "meanResTime" : 322.8729656839965,
    "medianResTime" : 174.0,
    "minResTime" : 4.0,
    "maxResTime" : 5404.0,
    "pct1ResTime" : 586.0,
    "pct2ResTime" : 769.0,
    "pct3ResTime" : 1257.9900000000016,
    "throughput" : 18.012132602663545,
    "receivedKBytesPerSec" : 10.890137610680895,
    "sentKBytesPerSec" : 11.029902077716581
  },
  "Get Beneficiaries Request" : {
    "transaction" : "Get Beneficiaries Request",
    "sampleCount" : 21104,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 95.61533358605013,
    "medianResTime" : 34.0,
    "minResTime" : 4.0,
    "maxResTime" : 1971.0,
    "pct1ResTime" : 249.0,
    "pct2ResTime" : 375.0,
    "pct3ResTime" : 647.0,
    "throughput" : 18.012374118649173,
    "receivedKBytesPerSec" : 15.13679251485526,
    "sentKBytesPerSec" : 6.571893491723987
  },
  "Get Login History Request" : {
    "transaction" : "Get Login History Request",
    "sampleCount" : 21029,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.9040848352272,
    "medianResTime" : 31.0,
    "minResTime" : 4.0,
    "maxResTime" : 1710.0,
    "pct1ResTime" : 239.0,
    "pct2ResTime" : 363.9500000000007,
    "pct3ResTime" : 667.9800000000032,
    "throughput" : 18.03217820720927,
    "receivedKBytesPerSec" : 127.28386865692471,
    "sentKBytesPerSec" : 6.579176726107943
  },
  "Get Cards Request" : {
    "transaction" : "Get Cards Request",
    "sampleCount" : 21335,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.08333723927882,
    "medianResTime" : 85.0,
    "minResTime" : 4.0,
    "maxResTime" : 2077.0,
    "pct1ResTime" : 413.90000000000146,
    "pct2ResTime" : 549.0,
    "pct3ResTime" : 906.9800000000032,
    "throughput" : 18.04829685324328,
    "receivedKBytesPerSec" : 65.34193197881578,
    "sentKBytesPerSec" : 6.443967905585455
  },
  "Get Transaction Request" : {
    "transaction" : "Get Transaction Request",
    "sampleCount" : 21452,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 226.6234849897457,
    "medianResTime" : 132.0,
    "minResTime" : 5.0,
    "maxResTime" : 4145.0,
    "pct1ResTime" : 512.0,
    "pct2ResTime" : 678.0,
    "pct3ResTime" : 1092.0,
    "throughput" : 18.029739152067723,
    "receivedKBytesPerSec" : 697.7863381725433,
    "sentKBytesPerSec" : 6.560622372746703
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 443800,
    "errorCount" : 15093,
    "errorPct" : 3.4008563,
    "meanResTime" : 187.00126858944887,
    "medianResTime" : 81.0,
    "minResTime" : 3.0,
    "maxResTime" : 7445.0,
    "pct1ResTime" : 284.90000000000146,
    "pct2ResTime" : 362.9500000000007,
    "pct3ResTime" : 562.0,
    "throughput" : 369.90885639151327,
    "receivedKBytesPerSec" : 1083.0420927736286,
    "sentKBytesPerSec" : 153.63199885731876
  },
  "Add Beneficiary Request" : {
    "transaction" : "Add Beneficiary Request",
    "sampleCount" : 21147,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 139.77557100297932,
    "medianResTime" : 68.0,
    "minResTime" : 13.0,
    "maxResTime" : 2186.0,
    "pct1ResTime" : 301.0,
    "pct2ResTime" : 419.0,
    "pct3ResTime" : 725.9900000000016,
    "throughput" : 18.0214959196613,
    "receivedKBytesPerSec" : 10.593877051194701,
    "sentKBytesPerSec" : 8.542965307906636
  },
  "Phone TopUp Request" : {
    "transaction" : "Phone TopUp Request",
    "sampleCount" : 20999,
    "errorCount" : 2661,
    "errorPct" : 12.672032,
    "meanResTime" : 110.05757417019814,
    "medianResTime" : 58.0,
    "minResTime" : 5.0,
    "maxResTime" : 2098.0,
    "pct1ResTime" : 276.0,
    "pct2ResTime" : 414.9500000000007,
    "pct3ResTime" : 732.0,
    "throughput" : 18.063624836774473,
    "receivedKBytesPerSec" : 6.432817393808785,
    "sentKBytesPerSec" : 9.481016114649696
  },
  "Get Anagrafica Request" : {
    "transaction" : "Get Anagrafica Request",
    "sampleCount" : 20693,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 264.1639201662397,
    "medianResTime" : 138.0,
    "minResTime" : 3.0,
    "maxResTime" : 3183.0,
    "pct1ResTime" : 631.0,
    "pct2ResTime" : 903.0,
    "pct3ResTime" : 1504.9400000000096,
    "throughput" : 18.058893653860586,
    "receivedKBytesPerSec" : 11.44952974676488,
    "sentKBytesPerSec" : 6.500710375409517
  },
  "Add Card Request" : {
    "transaction" : "Add Card Request",
    "sampleCount" : 21273,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 165.96427396230013,
    "medianResTime" : 96.0,
    "minResTime" : 13.0,
    "maxResTime" : 2092.0,
    "pct1ResTime" : 406.0,
    "pct2ResTime" : 535.0,
    "pct3ResTime" : 832.9900000000016,
    "throughput" : 18.03005942215325,
    "receivedKBytesPerSec" : 9.904253383125837,
    "sentKBytesPerSec" : 7.4410949883588176
  },
  "Freeze Card Request" : {
    "transaction" : "Freeze Card Request",
    "sampleCount" : 21237,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 157.85525262513505,
    "medianResTime" : 84.0,
    "minResTime" : 13.0,
    "maxResTime" : 2167.0,
    "pct1ResTime" : 364.0,
    "pct2ResTime" : 485.0,
    "pct3ResTime" : 783.9900000000016,
    "throughput" : 18.033157165371446,
    "receivedKBytesPerSec" : 9.771877446580689,
    "sentKBytesPerSec" : 6.96494935498368
  },
  "Create Savings Goal Request" : {
    "transaction" : "Create Savings Goal Request",
    "sampleCount" : 20928,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 133.59432339449526,
    "medianResTime" : 71.0,
    "minResTime" : 12.0,
    "maxResTime" : 2414.0,
    "pct1ResTime" : 346.0,
    "pct2ResTime" : 497.0,
    "pct3ResTime" : 842.9800000000032,
    "throughput" : 18.074739670374374,
    "receivedKBytesPerSec" : 8.964873590232058,
    "sentKBytesPerSec" : 8.499135716222787
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 21633,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 353.52341330374884,
    "medianResTime" : 200.0,
    "minResTime" : 79.0,
    "maxResTime" : 5747.0,
    "pct1ResTime" : 471.0,
    "pct2ResTime" : 673.9500000000007,
    "pct3ResTime" : 1125.0,
    "throughput" : 18.03266936521803,
    "receivedKBytesPerSec" : 12.542175338961753,
    "sentKBytesPerSec" : 4.642009420304654
  },
  "Unfreeze Card Request" : {
    "transaction" : "Unfreeze Card Request",
    "sampleCount" : 21192,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 151.60801245752964,
    "medianResTime" : 75.0,
    "minResTime" : 13.0,
    "maxResTime" : 1692.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 446.0,
    "pct3ResTime" : 736.0,
    "throughput" : 18.015781661512094,
    "receivedKBytesPerSec" : 9.780051334871914,
    "sentKBytesPerSec" : 6.993415095836359
  },
  "Get Savings Goal Request" : {
    "transaction" : "Get Savings Goal Request",
    "sampleCount" : 20895,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.11318497248084,
    "medianResTime" : 55.0,
    "minResTime" : 4.0,
    "maxResTime" : 2064.0,
    "pct1ResTime" : 367.0,
    "pct2ResTime" : 525.9500000000007,
    "pct3ResTime" : 901.0,
    "throughput" : 18.06874163904543,
    "receivedKBytesPerSec" : 10.431619180462153,
    "sentKBytesPerSec" : 6.59247519763632
  },
  "Application Flow" : {
    "transaction" : "Application Flow",
    "sampleCount" : 20747,
    "errorCount" : 5624,
    "errorPct" : 27.107534,
    "meanResTime" : 3954.4306164746913,
    "medianResTime" : 3532.0,
    "minResTime" : 1001.0,
    "maxResTime" : 15816.0,
    "pct1ResTime" : 5087.9000000000015,
    "pct2ResTime" : 5858.950000000001,
    "pct3ResTime" : 9895.960000000006,
    "throughput" : 17.908935218114895,
    "receivedKBytesPerSec" : 1080.7132069090794,
    "sentKBytesPerSec" : 156.21373270270018
  },
  "Delete Beneficiary Request" : {
    "transaction" : "Delete Beneficiary Request",
    "sampleCount" : 21063,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 107.93647628542934,
    "medianResTime" : 57.0,
    "minResTime" : 13.0,
    "maxResTime" : 1607.0,
    "pct1ResTime" : 263.0,
    "pct2ResTime" : 381.0,
    "pct3ResTime" : 646.0,
    "throughput" : 18.0107382068272,
    "receivedKBytesPerSec" : 6.349488762367792,
    "sentKBytesPerSec" : 7.0638161956409276
  }
}